{
  "id": "8afc24f8-50ab-49a8-a6a2-e838ce635f59",
  "content": "In today's video, I'm going to talk about five Gen AI and agentic AI projects which will help you build necessary AI skills for today's era and it will add lot of weight to your resume because you'll be building a solid project portfolio which is not based on toy projects but these projects are inspired from real life industry use cases. I have my own company called ATIC Technologies where we work on building AI solutions for our clients and based on that industry experience we have built this five projects. Now the first four projects are guided project on YouTube where we have given step-by-step explanation of how to build this project along with data set and code and the last project is unguided project where we have given you data set problem statement and you will be building that project on your own. I'm going to include a PDF file with customization ideas for first four guided projects so that you will build the project and enhance it to give it your own unique flavor. It should not look like you have just copied the project from YouTube. All the resources and code will be given to you. Let's get started. The first project is coder buddy which is an AI software engineer similar to deani or lovable where you give a prompt and it will build a fully functional software application for you. In this project you'll be able to type a prompt such as create a calculator web application and it will generate the code along with nice front end. You can say something like create a todo app and it will build that application for you. This is an agentic AI project which is built using langraph lang chain GPD open source model and gro cloud. The project is available on YouTube. I'm going to include a link of this in the document which I have attached in the video description. Once you have built this project using the YouTube video, you can add these two customization. The first one is building a front end like lovable because if you look at this particular video, you are giving a prompt on the command line. And you see create a simple calculator web app and it is generating the code everything for you. So it will show see the code is generated and when you click on index.html it will open the calculator app. But you can make it more like lovable where you can build a UI either in stimulate or in react and you just give this kind of prompt and it will generate this kind of application for you. The second customization idea is to add option to modify current functionality and UI. In our project once you give a prompt the code is generated but now you can add a functionality like lovable once again where you can say okay this new task button is on top left move it on top right. See move the new task button on top left. It used to be on top right and it will do that work for you. The second project is old email generator. This project is for software services companies who target clients such as Nike, JP Morgan etc. And the way sales team in these companies send cold email to these potential clients is for example they will go to Nike's website and they will find out the current job posting that they have. Let's say they have a job posting for React developer. It means they have need of this person and these companies will give a pitch that instead of hiring a full-time person, why don't you take services from us? Okay, so that's a cold email that they'll be sending. In the email generator that we'll build, we'll have streamlit UI where you can post a job post from Nike, let's say. And when you hit submit, it will generate a cold email using llm and drag. You see, it generated this nice cold email using llm and drag. And here is the complete architecture. In this video, I have gone step by step, but just to give you an overview, you will extract the role skills description from a job page. And by the way, we are using Llama open source model here. And then you index everything into Chromma DB, which is your vector database. And you have also indexed your portfolio links. So you will do semantic search for your portfolio links using this job description. and then llm again llama will generate a nice email for you. In terms of text tag we are using llama chromadb lang chain and streamllet. Now here are two customization ideas. First add dynamic customization options to streamllet for users to select desired email tone and call to action. See right now in this particular UI there is no option for email tone etc. Right? It's just a simple UI which lets you uh enter a URL. But here you can add two additional button where you can specify your tone like friendly whether you want to be salesy whatever and then you also specify call to action. Let's say here's my email contact me on this page or you know reach out to this phone number etc. The second one will be we are indexing in chromb just the portfolio links with only the text tag. So this is what we are indexing. Now you can add another CSV file which will contain a industry-wise client portfolio. So we have various industry right retail, healthcare, finance etc. And for each industry you can have a separate portfolio. In ATL for example we mainly target healthcare and retail. We have niche in these two industry. We have expertise. So you can have this kind of industry specific portfolios which are indexed in your chromob and the email that gets generated will contain those portfolios. Let me take a moment to thank today's sponsor data impulse. Any AI project is not complete without highquality data and getting highquality data from internet can be challenging. This is where a tool like data impulse can help. When your AI needs location aware highquality data, whether it's grapping dynamic content from internet or verifying regional results, data impulse delivers. You get access to premium residential, mobile, and data center proxies all with a 90 million plus IPs across 195 plus global locations. The best part, it is pay for go. We have listed on the screen the pricing for different proxies. Managing everything is affordless. you use their intuitive dashboard or API and enjoy their 24x7 human live support. If you want smarter location aware AI, head over to data impulse link in the video description. Now back to the video. The next project is LinkedIn post generator. This project is useful to influencers. For example, we have this influencer Muskan Honda who has 80,000 subscribers. Now based on her past post, this project will retrieve the major themes. you know she writes on mental health, career guidance, these kind of topics. So you can build this kind of streamlit UI where you can select a topic and it will generate a post which will look similar to your post. You know you have specific way of writing post. So it will mimic your tone your writing style etc and it will generate these post for you. In terms of technical architecture I have mentioned here you are having all these options from the drop-down. So you take those options. Okay. And by the way to generate these options you are parsing your past post. Okay. And once that is done it's like a two-tier project. In the second one you will generate a prompt using llama opensource model. In terms of technology stack we have used llama chromab lang chain and streamllet. Folks remember lang chain lang graph chromob streamllet. These are very modern tools. Once you have these keywords on your resume, it will grab the attention of recruiter. Customization ideas are in stimulate UI, you can add option for post, length and tone. Right now in the UI, you have option for topic, length, language. Of course, there is a length which is short etc. But you can enter more quantitative things such as 200 words, 300 words, etc. And you can also enter tone. The second feature you can add is to generate multiple post at once. Right. right now is generating just one. I'm also an influencer who writes regular post on LinkedIn and what I do is I use this application called Publer where I have my content scheduled for next month or so. So you can generate all the post in bulk and let the influencer schedule those post in advance. The next project is very interesting is related to my Bloomberg experience where you are building an equity research analysis tool where on the left hand side you have bunch of URL as an equity research analyst. What you'll be doing is let's say you are doing analysis on Tesla stock. You will come to your job and every day you will be going through news articles related to Tesla just to know what's going on with the company. And here in this tool you are posting all those articles here and then on the right hand side you can just ask a question. Okay, whatever is your question? What is the price of whatever your motor etc. and it will generate the answer for you. Now in terms of architecture, you'll be using a rack pipeline retrieval augmented generation using lang chain where you'll be indexing the news articles into phase vector database. Okay, it's a vector database by Facebook and you are doing chunking, you are doing retrieval, you are using LLM which is OpenAI. So you are using OpenAI GPT as your LLM model. All the code is provided here folks. One of the clients that we had at ATL we are building a PC for them and the PC looked very similar to this. So once again a very real project and here are the two customization ideas that we have instead of phase you can use chromadb or mil etc and you can also add offline processing mode. The last project is unguided project which is a code basics rumé project challenge. We conduct this project challenges on our website every month. This is free anybody can participate. We give a real life industry problem statement along with the data set and you know anything else that will help you build this project. So you can go through this page and you can start working on this. Now you'll be able to see the submissions from the winners. So this this challenge is by the way over and you'll be able to see the submissions from other winners and this will help you not only build the the required AI skills but increase your online credibility. Okay. So we have given a starter GitHub repo. We have also given you a copy of a sample LinkedIn post that you'll be doing after you are done working on this project. In this project you are building a rag based chatboard but it is having a feature of role based access. If you look at most of the industry projects when you have a chatboard based on your role you'll be able to see only certain information. Let's say if you are from HR you'll be able to see salary of people but if you're not from HR you won't be able to see it. So it will have this kind of role based uh access control. Okay also known as RBAC. So go through it and work on this project. That's it folks. I wish you all the best. If you have any suggestion for what kind of project we should build next for our channel, please post in the comment box below. If you like this video, give it a thumbs up and share it with your friends. Thank you for watching. [Music]",
  "source": "https://youtu.be/p54vr-NyxDc",
  "created_at": "2025-09-27T16:32:33.793847",
  "metadata": {
    "type": "youtube"
  }
}